index.org
#+TITLE: Captured
#+OPTIONS: title:nil H:2
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://fonts.googleapis.com/css?family=EB+Garamond" />
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="capture.css" />
#+HTML_HEAD: <meta name="viewport" content="width=device-width, initial-scale=1">
* Inbox
** React Hooks in PureScript
 Source: [2019-03-21 Thu], [[https://github.com/spicydonuts/purescript-react-basic-hooks][spicydonuts/purescript-react-basic-hooks: An implementation of React hooks on top of purescript-react-basic]]
  #+BEGIN_QUOTE
 This library provides the React.Basic.Hooks module, which can completely replace the React.Basic module. It borrows a few types from the current React.Basic module like ReactComponent and JSX to make it easy to use both versions in the same project.
 #+END_QUOTE
** Nice quote about programming
 Source: [2019-03-21 Thu], [[http://eloquentjavascript.net/1st_edition/chapter6.html#p61d9c58b7ccd55b][Functional Programming -- Eloquent JavaScript]]
  #+BEGIN_QUOTE
 Admittedly, in most cases, breaking a program does not cause any large explosions. But when a program, by someone's ignorant tinkering, has degenerated into a ramshackle mass of errors, reshaping it into something sensible is a terrible labour ― sometimes you might just as well start over.
 #+END_QUOTE
**  [[https://www.nytimes.com/2019/03/12/technology/how-to-disappear-surveillance-state.html][How a Bitcoin Evangelist Made Himself Vanish, in 15 (Not So Easy) Steps - The New York Times]] 
 Captured On: [2019-03-21 Thu 11:04]

 Impressive 

**  [[https://blogarithms.github.io/articles/2019-03/cracking-dp-part-one][The One On Dynamic Programming! | Blogarithms]] 
 Captured On: [2019-03-21 Thu 11:04]

** [PDF] [[https://web.archive.org/web/20190315213523/https:/stefan-klinger.de/files/monadGuide.pdf][A hacker's guide to Monad]] 
 Captured On: [2019-03-21 Thu 11:09]

** [PDF] [[https://web.archive.org/web/20190308183038/https:/wiki.haskell.org/wikiupload/e/e9/Typeclassopedia.pdf][TypeClassopedia]] 
 Captured On: [2019-03-21 Thu 11:11]

** [PDF] [[https://web.archive.org/web/20190308182743/http:/www.staff.city.ac.uk/~ross/papers/Applicative.pdf][Applicative Programming with effects]] 
 Captured On: [2019-03-21 Thu 11:12]

** [PDF] [[https://web.archive.org/web/20190308075944/http:/homepages.inf.ed.ac.uk/wadler/papers/marktoberdorf/baastad.pdf][Monad for functional programming]] 
 Captured On: [2019-03-21 Thu 11:15]
 
** Life in game development
 Source: [2019-03-21 Thu], [[https://www.polygon.com/2019/3/5/18233699/game-developer-layoffs-unions-katie-chironis][What it’s like to be laid off from your video game studio - Polygon]]
  #+BEGIN_QUOTE
 Dream jobs are a funny thing. You can make money doing what you love. That’s pretty cool. But after multiple interstate, or intercontinental, moves for the sake of finding a new job, or rebooting your social life for the fifth time, or having to explain to your daughter why she’s changing schools and leaving her friends, the cool parts lose their luster.

 And once that luster is gone, a dream job is just another job.
 #+END_QUOTE

** [PDF] [[http://web.archive.org/web/20130823222012/http:/www.cs.tufts.edu/~nr/comp150fp/archive/richard-bird/sudoku.pdf][A program to solve Sudoku]] 
 Captured On: [2019-03-21 Thu 11:19]
** Series of introduction to Functional Programming
 Source: [2019-03-22 Fri], [[https://codurance.com/2018/08/09/the-functional-style-part-1/][The Functional Style - Part 1 | Codurance | Craft at Heart | London | Barcelona]]
  #+BEGIN_QUOTE
 So over the course of this nine part series I want to cover the topics that I think are important in functional programming. I will try to explain first-class and higher-order functions, map and reduce, currying, function composition and monads, lazy evaluation and persistent data structures. All will be illustrated with code examples wherever possible. Most (but not all) of the code will be in Java, Groovy and Clojure because that is what I know best.

 Topics you will not find in this series include monoids, functors, applicatives, and category theory. 
 #+END_QUOTE
