index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-03-26 Tue 13:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Captured</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="root" />
<link rel="stylesheet" type="text/css" href="https://fonts.googleapis.com/css?family=EB+Garamond" />
<link rel="stylesheet" type="text/css" href="capture.css" />
<meta name="viewport" content="width=device-width, initial-scale=1">
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga7a4311">1. Inbox</a>
<ul>
<li><a href="#org594a224">1.1. React Hooks in PureScript</a></li>
<li><a href="#org83b1776">1.2. Nice quote about programming</a></li>
<li><a href="#org5162266">1.3. How a Bitcoin Evangelist Made Himself Vanish, in 15 (Not So Easy) Steps - The New York Times</a></li>
<li><a href="#org2364686">1.4. The One On Dynamic Programming! | Blogarithms</a></li>
<li><a href="#org75f4401">1.5. [PDF] A hacker's guide to Monad</a></li>
<li><a href="#org9b45f02">1.6. [PDF] TypeClassopedia</a></li>
<li><a href="#orgd4a29d4">1.7. [PDF] Applicative Programming with effects</a></li>
<li><a href="#org0ab7d3a">1.8. [PDF] Monad for functional programming</a></li>
<li><a href="#orgc6c8b0d">1.9. Life in game development</a></li>
<li><a href="#org7b28ce0">1.10. [PDF] A program to solve Sudoku</a></li>
<li><a href="#orgc354702">1.11. Series of introduction to Functional Programming</a></li>
<li><a href="#org7b09893">1.12. Figma rewrite parts of its TypeScript multiplayer server with Rust</a></li>
<li><a href="#org0c0a8a0">1.13. Recover the dropped git stash</a></li>
<li><a href="#org5b2d0b2">1.14. Article: Beating the Averages</a></li>
<li><a href="#org3f2e906">1.15. Re-educating Rita</a></li>
<li><a href="#org9d82616">1.16. Article: How to get customers for your side project</a></li>
<li><a href="#org7acaf08">1.17. A complete guide to threads in Node.js – LogRocket</a></li>
<li><a href="#orgf45ac5e">1.18. Opinion | Forget Self-Driving Cars. Bring Back the Stick Shift. - The</a></li>
<li><a href="#orgb8f5348">1.19. Article: How to turn a Raspberry Pi into a game console</a></li>
<li><a href="#org817485b">1.20. Article: The Inside Story of Reddit's Redesign</a></li>
<li><a href="#org855b39a">1.21. Utilities for efficient filesystem navigation in emacs</a></li>
<li><a href="#orga20473c">1.22. Link to open Gmail in compose mode</a></li>
<li><a href="#org33a03c5">1.23. Avoid Debt</a></li>
<li><a href="#orgbe94f63">1.24. DO NOT SCATTER YOUR POWERS</a></li>
<li><a href="#orgb9ede73">1.25. Waiting for an element to be created</a></li>
<li><a href="#org6233cc4">1.26. How, in general, does Node.js handle 10,000 concurrent requests? -</a></li>
<li><a href="#org04a2856">1.27. Functional Thinking</a></li>
<li><a href="#orgd282f15">1.28. nealford.com • Functional Thinking</a></li>
<li><a href="#org470568c">1.29. Use Pandoc in Python</a></li>
<li><a href="#orga1dd618">1.30. How the Brain Links Gestures, Perception and Meaning | Quanta Magazine</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga7a4311" class="outline-2">
<h2 id="orga7a4311"><span class="section-number-2">1</span> Inbox</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org594a224" class="outline-3">
<h3 id="org594a224"><span class="section-number-3">1.1</span> React Hooks in PureScript</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Source: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-21 Thu]</span></span>, <a href="https://github.com/spicydonuts/purescript-react-basic-hooks">spicydonuts/purescript-react-basic-hooks: An implementation of React hooks on top of purescript-react-basic</a>
</p>
<blockquote>
<p>
This library provides the React.Basic.Hooks module, which can completely replace the React.Basic module. It borrows a few types from the current React.Basic module like ReactComponent and JSX to make it easy to use both versions in the same project.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org83b1776" class="outline-3">
<h3 id="org83b1776"><span class="section-number-3">1.2</span> Nice quote about programming</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Source: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-21 Thu]</span></span>, <a href="http://eloquentjavascript.net/1st_edition/chapter6.html#p61d9c58b7ccd55b">Functional Programming &#x2013; Eloquent JavaScript</a>
</p>
<blockquote>
<p>
Admittedly, in most cases, breaking a program does not cause any large explosions. But when a program, by someone's ignorant tinkering, has degenerated into a ramshackle mass of errors, reshaping it into something sensible is a terrible labour ― sometimes you might just as well start over.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org5162266" class="outline-3">
<h3 id="org5162266"><span class="section-number-3">1.3</span> <a href="https://www.nytimes.com/2019/03/12/technology/how-to-disappear-surveillance-state.html">How a Bitcoin Evangelist Made Himself Vanish, in 15 (Not So Easy) Steps - The New York Times</a></h3>
<div class="outline-text-3" id="text-1-3">
<p>
Captured On: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-21 Thu 11:04]</span></span>
</p>

<p>
Impressive 
</p>
</div>
</div>

<div id="outline-container-org2364686" class="outline-3">
<h3 id="org2364686"><span class="section-number-3">1.4</span> <a href="https://blogarithms.github.io/articles/2019-03/cracking-dp-part-one">The One On Dynamic Programming! | Blogarithms</a></h3>
<div class="outline-text-3" id="text-1-4">
<p>
Captured On: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-21 Thu 11:04]</span></span>
</p>
</div>
</div>

<div id="outline-container-org75f4401" class="outline-3">
<h3 id="org75f4401"><span class="section-number-3">1.5</span> [PDF] <a href="https://web.archive.org/web/20190315213523/https:/stefan-klinger.de/files/monadGuide.pdf">A hacker's guide to Monad</a></h3>
<div class="outline-text-3" id="text-1-5">
<p>
Captured On: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-21 Thu 11:09]</span></span>
</p>
</div>
</div>

<div id="outline-container-org9b45f02" class="outline-3">
<h3 id="org9b45f02"><span class="section-number-3">1.6</span> [PDF] <a href="https://web.archive.org/web/20190308183038/https:/wiki.haskell.org/wikiupload/e/e9/Typeclassopedia.pdf">TypeClassopedia</a></h3>
<div class="outline-text-3" id="text-1-6">
<p>
Captured On: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-21 Thu 11:11]</span></span>
</p>
</div>
</div>

<div id="outline-container-orgd4a29d4" class="outline-3">
<h3 id="orgd4a29d4"><span class="section-number-3">1.7</span> [PDF] <a href="https://web.archive.org/web/20190308182743/http:/www.staff.city.ac.uk/~ross/papers/Applicative.pdf">Applicative Programming with effects</a></h3>
<div class="outline-text-3" id="text-1-7">
<p>
Captured On: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-21 Thu 11:12]</span></span>
</p>
</div>
</div>

<div id="outline-container-org0ab7d3a" class="outline-3">
<h3 id="org0ab7d3a"><span class="section-number-3">1.8</span> [PDF] <a href="https://web.archive.org/web/20190308075944/http:/homepages.inf.ed.ac.uk/wadler/papers/marktoberdorf/baastad.pdf">Monad for functional programming</a></h3>
<div class="outline-text-3" id="text-1-8">
<p>
Captured On: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-21 Thu 11:15]</span></span>
</p>
</div>
</div>

<div id="outline-container-orgc6c8b0d" class="outline-3">
<h3 id="orgc6c8b0d"><span class="section-number-3">1.9</span> Life in game development</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Source: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-21 Thu]</span></span>, <a href="https://www.polygon.com/2019/3/5/18233699/game-developer-layoffs-unions-katie-chironis">What it’s like to be laid off from your video game studio - Polygon</a>
</p>
<blockquote>
<p>
Dream jobs are a funny thing. You can make money doing what you love. That’s pretty cool. But after multiple interstate, or intercontinental, moves for the sake of finding a new job, or rebooting your social life for the fifth time, or having to explain to your daughter why she’s changing schools and leaving her friends, the cool parts lose their luster.
</p>

<p>
And once that luster is gone, a dream job is just another job.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org7b28ce0" class="outline-3">
<h3 id="org7b28ce0"><span class="section-number-3">1.10</span> [PDF] <a href="http://web.archive.org/web/20130823222012/http:/www.cs.tufts.edu/~nr/comp150fp/archive/richard-bird/sudoku.pdf">A program to solve Sudoku</a></h3>
<div class="outline-text-3" id="text-1-10">
<p>
Captured On: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-21 Thu 11:19]</span></span>
</p>
</div>
</div>
<div id="outline-container-orgc354702" class="outline-3">
<h3 id="orgc354702"><span class="section-number-3">1.11</span> Series of introduction to Functional Programming</h3>
<div class="outline-text-3" id="text-1-11">
<p>
Source: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-22 Fri]</span></span>, <a href="https://codurance.com/2018/08/09/the-functional-style-part-1/">The Functional Style - Part 1 | Codurance | Craft at Heart | London | Barcelona</a>
</p>
<blockquote>
<p>
So over the course of this nine part series I want to cover the topics that I think are important in functional programming. I will try to explain first-class and higher-order functions, map and reduce, currying, function composition and monads, lazy evaluation and persistent data structures. All will be illustrated with code examples wherever possible. Most (but not all) of the code will be in Java, Groovy and Clojure because that is what I know best.
</p>

<p>
Topics you will not find in this series include monoids, functors, applicatives, and category theory. 
</p>
</blockquote>
</div>
</div>
