index.org
** Figma rewrite parts of its TypeScript multiplayer server with Rust
 Source: [2019-03-22 Fri], [[https://www.figma.com/blog/rust-in-production-at-figma/][How Mozilla’s Rust dramatically improved our server-side performance]]
 
Their problem:
  #+BEGIN_QUOTE
 The main problem with the old server was the unpredictable latency spikes during syncing. The server was written in TypeScript and, being single-threaded, couldn’t process operations in parallel. That meant a single slow operation would lock up the entire worker until it was complete. A common operation is to encode the document and Figma documents can get very large, so operations would take an arbitrarily-long amount of time. Users connected to that worker would be unable to sync their changes in the meantime.
 #+END_QUOTE

And the solution:
#+BEGIN_QUOTE
we did by moving the performance-sensitive parts of the multiplayer server into a separate child process. That child process is written in Rust and communicates with its host process using stdin and stdout.
#+END_QUOTE
** Recover the dropped git stash
 Source: [2019-03-22 Fri], [[http://inlehmansterms.net/2015/09/19/recover-a-dropped-git-stash/][Recover a dropped Git stash - In Lehman's Terms]]
  #+BEGIN_QUOTE
 Dangling commit: commits that not linked to any commit / branch,.. for most of the times, dropped stashes can be found as a dangling commit.

 We pipe the output of git fsck thru awk to only log the hashes of the dangling commits.

 git fsck --no-reflogs | awk '/dangling commit/ {print $3}'

 This still might produce a number of hashes. To better determine which hash corresponds to the commit you dropped from the stash, you can pass the hashes to git log or git show to get more information.
 
 When you found the hash, checkout to revert it back.
 #+END_QUOTE


** Article: Beating the Averages

Captured On: [2019-03-22 12:24:26]

Beating the Averages by Paul Graham
http://www.paulgraham.com/avg.html?viewfullsite=1

** Re-educating Rita

Captured On: [2019-03-22 21:28:44] from email

"Character skills" such as perseverance, sociability and curiosity, will be increasingly important in a world of greater automation
https://outline.com/PpFxaL


** Article: How to get customers for your side project

Captured On: [2019-03-24 01:10:25] from email

How I got my first 10 customers for my side-project and what Ive learned from them
https://blog.cronhub.io/how-i-acquired-my-first-10-customers-for-cronhub/
https://medium.freecodecamp.org/how-i-acquired-my-first-10-customers-for-my-side-project-c4ee892a70a2


** A complete guide to threads in Node.js – LogRocket

Captured On: [2019-03-24 14:49:39] from email

A complete guide to threads in Node.js  LogRocket
https://blog.logrocket.com/a-complete-guide-to-threads-in-node-js-4fa3898fe74f


** Opinion | Forget Self-Driving Cars. Bring Back the Stick Shift. - The
 New York Times

Captured On: [2019-03-24 14:52:14] from email

Opinion | Forget Self-Driving Cars. Bring Back the Stick Shift. - The New York Times
https://www.nytimes.com/2019/03/23/opinion/sunday/stick-shift-cars.html


** Article: How to turn a Raspberry Pi into a game console

Captured On: [2019-03-24 23:22:04] from email

How to turn a Raspberry Pi into a game console - 
https://www.engadget.com/2019/03/24/how-to-turn-a-raspberry-pi-into-a-game-console/
The Recalbox manager can do other things, too. You can access a variety 
of settings from the Web manager, including wireless network settings 
and shaders. You can even press a button to take a screenshot when 
you're playing games. If you don't like the browser-based manager, 
you can also access
 your Raspberry Pi in Windows Explorer or Finder on Mac, similar to how you'd use a 
network-attached storage device
.


** Article: The Inside Story of Reddit's Redesign

Captured On: [2019-03-24 23:25:43] from email

https://www.wired.com/story/reddit-redesign/
But another goal goes much deeper: changing the constitution of the 
site, making it more welcoming to people who never thought they could 
find a home there before. On the new Reddit, we are all just aliens, 
exploring the vast community of foreign planets, trying to find our 
place in the universe.


** Utilities for efficient filesystem navigation in emacs

Captured On: [2019-03-25 09:39:40] from email

https://lorefnon.me/2015/11/15/utilities-for-efficient-filesystem-navigation-in-emacs.html
While Emacs is a fairly productive editor on its own, for navigating 
through the files in a large project a few community contributed 
extensions can make things a lot easier


** Link to open Gmail in compose mode

Captured On: [2019-03-25 09:49:38] from email

https://mail.google.com/mail/?fs=1&view=cm&shva=1&su=
Note: If you want to program with this just start adding values to the end of the url above. I have already added a blank subject by ending the above url with &su=, so to add a subject just add a string to the end of the url above. For body, to, cc, and bcc fields use &body=, &to=, &cc=, &bcc= all with strings after word. Depending on your browser you may need to URI escape your field values.


** Avoid Debt

Captured On: [2019-03-25 10:12:12] from email

http://www.fourmilab.ch/etexts/www/barnum/moneygetting/moneygetting_chap4.html
Debt robs a man of his self-respect, and makes him almost despise himself. Grunting and groaning and working for what he has eaten up or worn out, and now when he is called upon to pay up, he has nothing to show for his money; this is properly termed working for a dead horse.


