index.html
<div id="outline-container-org7b09893" class="outline-3">
<h3 id="org7b09893"><span class="section-number-3">1.12</span> Figma rewrite parts of its TypeScript multiplayer server with Rust</h3>
<div class="outline-text-3" id="text-1-12">
<p>
Source: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-22 Fri]</span></span>, <a href="https://www.figma.com/blog/rust-in-production-at-figma/">How Mozilla’s Rust dramatically improved our server-side performance</a>
</p>

<p>
Their problem:
</p>
<blockquote>
<p>
The main problem with the old server was the unpredictable latency spikes during syncing. The server was written in TypeScript and, being single-threaded, couldn’t process operations in parallel. That meant a single slow operation would lock up the entire worker until it was complete. A common operation is to encode the document and Figma documents can get very large, so operations would take an arbitrarily-long amount of time. Users connected to that worker would be unable to sync their changes in the meantime.
</p>
</blockquote>

<p>
And the solution:
</p>
<blockquote>
<p>
we did by moving the performance-sensitive parts of the multiplayer server into a separate child process. That child process is written in Rust and communicates with its host process using stdin and stdout.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org0c0a8a0" class="outline-3">
<h3 id="org0c0a8a0"><span class="section-number-3">1.13</span> Recover the dropped git stash</h3>
<div class="outline-text-3" id="text-1-13">
<p>
Source: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-22 Fri]</span></span>, <a href="http://inlehmansterms.net/2015/09/19/recover-a-dropped-git-stash/">Recover a dropped Git stash - In Lehman's Terms</a>
</p>
<blockquote>
<p>
Dangling commit: commits that not linked to any commit / branch,.. for most of the times, dropped stashes can be found as a dangling commit.
</p>

<p>
We pipe the output of git fsck thru awk to only log the hashes of the dangling commits.
</p>

<p>
git fsck &#x2013;no-reflogs | awk '<i>dangling commit</i> {print $3}'
</p>

<p>
This still might produce a number of hashes. To better determine which hash corresponds to the commit you dropped from the stash, you can pass the hashes to git log or git show to get more information.
</p>

<p>
When you found the hash, checkout to revert it back.
</p>
</blockquote>
</div>
</div>


<div id="outline-container-org5b2d0b2" class="outline-3">
<h3 id="org5b2d0b2"><span class="section-number-3">1.14</span> Article: Beating the Averages</h3>
<div class="outline-text-3" id="text-1-14">
<p>
Captured On: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-22 Fri 12:24]</span></span>
</p>

<p>
Beating the Averages by Paul Graham
<a href="http://www.paulgraham.com/avg.html?viewfullsite=1">http://www.paulgraham.com/avg.html?viewfullsite=1</a>
</p>
</div>
</div>

<div id="outline-container-org3f2e906" class="outline-3">
<h3 id="org3f2e906"><span class="section-number-3">1.15</span> Re-educating Rita</h3>
<div class="outline-text-3" id="text-1-15">
<p>
Captured On: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-22 Fri 21:28] </span></span> from email
</p>

<p>
"Character skills" such as perseverance, sociability and curiosity, will be increasingly important in a world of greater automation
<a href="https://outline.com/PpFxaL">https://outline.com/PpFxaL</a>
</p>
</div>
</div>


<div id="outline-container-org9d82616" class="outline-3">
<h3 id="org9d82616"><span class="section-number-3">1.16</span> Article: How to get customers for your side project</h3>
<div class="outline-text-3" id="text-1-16">
<p>
Captured On: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-24 Sun 01:10] </span></span> from email
</p>

<p>
How I got my first 10 customers for my side-project and what Ive learned from them
<a href="https://blog.cronhub.io/how-i-acquired-my-first-10-customers-for-cronhub/">https://blog.cronhub.io/how-i-acquired-my-first-10-customers-for-cronhub/</a>
<a href="https://medium.freecodecamp.org/how-i-acquired-my-first-10-customers-for-my-side-project-c4ee892a70a2">https://medium.freecodecamp.org/how-i-acquired-my-first-10-customers-for-my-side-project-c4ee892a70a2</a>
</p>
</div>
</div>


<div id="outline-container-org7acaf08" class="outline-3">
<h3 id="org7acaf08"><span class="section-number-3">1.17</span> A complete guide to threads in Node.js – LogRocket</h3>
<div class="outline-text-3" id="text-1-17">
<p>
Captured On: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-24 Sun 14:49] </span></span> from email
</p>

<p>
A complete guide to threads in Node.js  LogRocket
<a href="https://blog.logrocket.com/a-complete-guide-to-threads-in-node-js-4fa3898fe74f">https://blog.logrocket.com/a-complete-guide-to-threads-in-node-js-4fa3898fe74f</a>
</p>
</div>
</div>


<div id="outline-container-orgf45ac5e" class="outline-3">
<h3 id="orgf45ac5e"><span class="section-number-3">1.18</span> Opinion | Forget Self-Driving Cars. Bring Back the Stick Shift. - The</h3>
<div class="outline-text-3" id="text-1-18">
<p>
New York Times
</p>

<p>
Captured On: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-24 Sun 14:52] </span></span> from email
</p>

<p>
Opinion | Forget Self-Driving Cars. Bring Back the Stick Shift. - The New York Times
<a href="https://www.nytimes.com/2019/03/23/opinion/sunday/stick-shift-cars.html">https://www.nytimes.com/2019/03/23/opinion/sunday/stick-shift-cars.html</a>
</p>
</div>
</div>


<div id="outline-container-orgb8f5348" class="outline-3">
<h3 id="orgb8f5348"><span class="section-number-3">1.19</span> Article: How to turn a Raspberry Pi into a game console</h3>
<div class="outline-text-3" id="text-1-19">
<p>
Captured On: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-24 Sun 23:22] </span></span> from email
</p>

<p>
How to turn a Raspberry Pi into a game console - 
<a href="https://www.engadget.com/2019/03/24/how-to-turn-a-raspberry-pi-into-a-game-console/">https://www.engadget.com/2019/03/24/how-to-turn-a-raspberry-pi-into-a-game-console/</a>
The Recalbox manager can do other things, too. You can access a variety 
of settings from the Web manager, including wireless network settings 
and shaders. You can even press a button to take a screenshot when 
you're playing games. If you don't like the browser-based manager, 
you can also access
 your Raspberry Pi in Windows Explorer or Finder on Mac, similar to how you'd use a 
network-attached storage device
.
</p>
</div>
</div>


<div id="outline-container-org817485b" class="outline-3">
<h3 id="org817485b"><span class="section-number-3">1.20</span> Article: The Inside Story of Reddit's Redesign</h3>
<div class="outline-text-3" id="text-1-20">
<p>
Captured On: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-24 Sun 23:25] </span></span> from email
</p>

<p>
<a href="https://www.wired.com/story/reddit-redesign/">https://www.wired.com/story/reddit-redesign/</a>
But another goal goes much deeper: changing the constitution of the 
site, making it more welcoming to people who never thought they could 
find a home there before. On the new Reddit, we are all just aliens, 
exploring the vast community of foreign planets, trying to find our 
place in the universe.
</p>
</div>
</div>


<div id="outline-container-org855b39a" class="outline-3">
<h3 id="org855b39a"><span class="section-number-3">1.21</span> Utilities for efficient filesystem navigation in emacs</h3>
<div class="outline-text-3" id="text-1-21">
<p>
Captured On: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-25 Mon 09:39] </span></span> from email
</p>

<p>
<a href="https://lorefnon.me/2015/11/15/utilities-for-efficient-filesystem-navigation-in-emacs.html">https://lorefnon.me/2015/11/15/utilities-for-efficient-filesystem-navigation-in-emacs.html</a>
While Emacs is a fairly productive editor on its own, for navigating 
through the files in a large project a few community contributed 
extensions can make things a lot easier
</p>
</div>
</div>


<div id="outline-container-orga20473c" class="outline-3">
<h3 id="orga20473c"><span class="section-number-3">1.22</span> Link to open Gmail in compose mode</h3>
<div class="outline-text-3" id="text-1-22">
<p>
Captured On: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-25 Mon 09:49] </span></span> from email
</p>

<p>
<a href="https://mail.google.com/mail/?fs=1&amp;view=cm&amp;shva=1&amp;su">https://mail.google.com/mail/?fs=1&amp;view=cm&amp;shva=1&amp;su</a>=
Note: If you want to program with this just start adding values to the end of the url above. I have already added a blank subject by ending the above url with &amp;su=, so to add a subject just add a string to the end of the url above. For body, to, cc, and bcc fields use &amp;body=, &amp;to=, &amp;cc=, &amp;bcc= all with strings after word. Depending on your browser you may need to URI escape your field values.
</p>
</div>
</div>


<div id="outline-container-org33a03c5" class="outline-3">
<h3 id="org33a03c5"><span class="section-number-3">1.23</span> Avoid Debt</h3>
<div class="outline-text-3" id="text-1-23">
<p>
Captured On: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-25 Mon 10:12] </span></span> from email
</p>

<p>
<a href="http://www.fourmilab.ch/etexts/www/barnum/moneygetting/moneygetting_chap4.html">http://www.fourmilab.ch/etexts/www/barnum/moneygetting/moneygetting_chap4.html</a>
Debt robs a man of his self-respect, and makes him almost despise himself. Grunting and groaning and working for what he has eaten up or worn out, and now when he is called upon to pay up, he has nothing to show for his money; this is properly termed working for a dead horse.
</p>
</div>
</div>
