index.org
** DO NOT SCATTER YOUR POWERS

Captured On: [2019-03-25 11:42:00] from email

http://www.fourmilab.ch/etexts/www/barnum/moneygetting/moneygetting_chap12.html
Engage in one kind of business only, and stick to it faithfully until you succeed, or until your experience shows that you should abandon it. A constant hammering on one nail will generally drive it home at last, so that it can be clinched. When a man's undivided attention is centered on one object, his mind will constantly be suggesting improvements of value, which would escape him if his brain was occupied by a dozen different subjects at once. Many a fortune has slipped through a man's fingers because he was engaged in too many occupations at a time. There is good sense in the old caution against having too many irons in the fire at once. 


** Waiting for an element to be created

Captured On: [2019-03-25 16:13:50] from email

https://paul.kinlan.me/waiting-for-an-element-to-be-created/
a small function called waitForElement that uses the MutationObserver to look for when an element with a given id is added to the DOM. When that element has been detected it will resolve the promise and return the element.


** How, in general, does Node.js handle 10,000 concurrent requests? -
 Stack Overflow

Captured On: [2019-03-26 00:51:43] from email

https://stackoverflow.com/questions/34855352/how-in-general-does-node-js-handle-10-000-concurrent-requests


** Functional Thinking

Captured On: [2019-03-26 01:04:59] from email

https://www.ebayinc.com/stories/blogs/tech/functional-thinking/
Imperative thinking became so natural, we see past verbose code. Nonetheless, it requires reading and understanding four lines of code to get to what the code is doing.
The real gain is not having three lines of code less. Very similar problems occur over and over again, sometimes on the same method. If the functional approach is used, every time we'll write less logic, reducing the odds of introducing errors.


** nealford.com • Functional Thinking

Captured On: [2019-03-26 01:05:38] from email

http://nealford.com/functionalthinking.html



** Use Pandoc in Python

Captured On: [2019-03-26 10:06:51]

#+BEGIN_HTML
  <div dir="ltr">
#+END_HTML

#+BEGIN_HTML
  <div>
#+END_HTML

[[https://pypi.org/project/pyandoc/]]

#+BEGIN_HTML
  </div>
#+END_HTML

#+BEGIN_HTML
  <div>
#+END_HTML



#+BEGIN_HTML
  </div>
#+END_HTML

#+BEGIN_HTML
  <div>
#+END_HTML

First, install Pyandoc:

#+BEGIN_HTML
  </div>
#+END_HTML

#+BEGIN_HTML
  <div style="margin-left:40px">
#+END_HTML

#+BEGIN_EXAMPLE
    pip install pyandoc
#+END_EXAMPLE

#+BEGIN_HTML
  </div>
#+END_HTML

#+BEGIN_HTML
  <div>
#+END_HTML

Then use it like this:

#+BEGIN_HTML
  </div>
#+END_HTML

#+BEGIN_HTML
  <div style="margin-left:40px">
#+END_HTML

#+BEGIN_EXAMPLE
    doc = pandoc.Document()
    doc.markdown = '''
    # I am an H1 Tag

    * bullet point
    * more points
    * point with [link](http://kennethreitz.com)!
    '''
    print doc.rst
#+END_EXAMPLE

#+BEGIN_HTML
  </div>
#+END_HTML



#+BEGIN_HTML
  </div>
#+END_HTML


** How the Brain Links Gestures, Perception and Meaning | Quanta Magazine

Captured On: [2019-03-26 10:09:04]

#+BEGIN_HTML
  <div dir="ltr">
#+END_HTML

[[https://www.quantamagazine.org/how-the-brain-links-gestures-perception-and-meaning-20190325/]]

Gesture allows us to express ourselves, and it also shapes the way we
understand and interpret others

#+BEGIN_HTML
  </div>
#+END_HTML

