index.html


<div id="outline-container-orgbe94f63" class="outline-3">
<h3 id="orgbe94f63"><span class="section-number-3">1.24</span> DO NOT SCATTER YOUR POWERS</h3>
<div class="outline-text-3" id="text-1-24">
<p>
Captured On: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-25 Mon 11:42] </span></span> from email
</p>

<p>
<a href="http://www.fourmilab.ch/etexts/www/barnum/moneygetting/moneygetting_chap12.html">http://www.fourmilab.ch/etexts/www/barnum/moneygetting/moneygetting_chap12.html</a>
Engage in one kind of business only, and stick to it faithfully until you succeed, or until your experience shows that you should abandon it. A constant hammering on one nail will generally drive it home at last, so that it can be clinched. When a man's undivided attention is centered on one object, his mind will constantly be suggesting improvements of value, which would escape him if his brain was occupied by a dozen different subjects at once. Many a fortune has slipped through a man's fingers because he was engaged in too many occupations at a time. There is good sense in the old caution against having too many irons in the fire at once. 
</p>
</div>
</div>


<div id="outline-container-orgb9ede73" class="outline-3">
<h3 id="orgb9ede73"><span class="section-number-3">1.25</span> Waiting for an element to be created</h3>
<div class="outline-text-3" id="text-1-25">
<p>
Captured On: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-25 Mon 16:13] </span></span> from email
</p>

<p>
<a href="https://paul.kinlan.me/waiting-for-an-element-to-be-created/">https://paul.kinlan.me/waiting-for-an-element-to-be-created/</a>
a small function called waitForElement that uses the MutationObserver to look for when an element with a given id is added to the DOM. When that element has been detected it will resolve the promise and return the element.
</p>
</div>
</div>


<div id="outline-container-org6233cc4" class="outline-3">
<h3 id="org6233cc4"><span class="section-number-3">1.26</span> How, in general, does Node.js handle 10,000 concurrent requests? -</h3>
<div class="outline-text-3" id="text-1-26">
<p>
Stack Overflow
</p>

<p>
Captured On: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-26 Tue 00:51] </span></span> from email
</p>

<p>
<a href="https://stackoverflow.com/questions/34855352/how-in-general-does-node-js-handle-10-000-concurrent-requests">https://stackoverflow.com/questions/34855352/how-in-general-does-node-js-handle-10-000-concurrent-requests</a>
</p>
</div>
</div>


<div id="outline-container-org04a2856" class="outline-3">
<h3 id="org04a2856"><span class="section-number-3">1.27</span> Functional Thinking</h3>
<div class="outline-text-3" id="text-1-27">
<p>
Captured On: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-26 Tue 01:04] </span></span> from email
</p>

<p>
<a href="https://www.ebayinc.com/stories/blogs/tech/functional-thinking/">https://www.ebayinc.com/stories/blogs/tech/functional-thinking/</a>
Imperative thinking became so natural, we see past verbose code. Nonetheless, it requires reading and understanding four lines of code to get to what the code is doing.
The real gain is not having three lines of code less. Very similar problems occur over and over again, sometimes on the same method. If the functional approach is used, every time we'll write less logic, reducing the odds of introducing errors.
</p>
</div>
</div>


<div id="outline-container-orgd282f15" class="outline-3">
<h3 id="orgd282f15"><span class="section-number-3">1.28</span> nealford.com • Functional Thinking</h3>
<div class="outline-text-3" id="text-1-28">
<p>
Captured On: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-26 Tue 01:05] </span></span> from email
</p>

<p>
<a href="http://nealford.com/functionalthinking.html">http://nealford.com/functionalthinking.html</a>
</p>
</div>
</div>









<div id="outline-container-org470568c" class="outline-3">
<h3 id="org470568c"><span class="section-number-3">1.29</span> Use Pandoc in Python</h3>
<div class="outline-text-3" id="text-1-29">
<p>
Captured On: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-26 Tue 10:06]</span></span>
</p>

<div class="HTML">
<p>
&lt;div&gt;
</p>

</div>

<p>
<a href="https://pypi.org/project/pyandoc/">https://pypi.org/project/pyandoc/</a>
</p>

<div class="HTML">
<p>
&lt;/div&gt;
</p>

</div>

<div class="HTML">
<p>
&lt;div&gt;
</p>

</div>

<p>
<br />
</p>

<div class="HTML">
<p>
&lt;/div&gt;
</p>

</div>

<div class="HTML">
<p>
&lt;div&gt;
</p>

</div>

<p>
First,installPyandoc:
</p>

<div class="HTML">
<p>
&lt;/div&gt;
</p>

</div>

<pre class="example">
pipinstallpyandoc
</pre>

<div class="HTML">
<p>
&lt;div&gt;
</p>

</div>

<p>
Thenuseitlikethis:
</p>

<div class="HTML">
<p>
&lt;/div&gt;
</p>

</div>

<pre class="example">
doc=pandoc.Document()doc.markdown='''#IamanH1Tag*bulletpoint*morepoints*pointwith[link](http://kennethreitz.com)!'''
printdoc.rst
</pre>

<p>
<br />
</p>
</div>
</div>


<div id="outline-container-orga1dd618" class="outline-3">
<h3 id="orga1dd618"><span class="section-number-3">1.30</span> How the Brain Links Gestures, Perception and Meaning | Quanta Magazine</h3>
<div class="outline-text-3" id="text-1-30">
<p>
Captured On: <span class="timestamp-wrapper"><span class="timestamp">[2019-03-26 Tue 10:09]</span></span>
</p>

<p>
<a href="https://www.quantamagazine.org/how-the-brain-links-gestures-perception-and-meaning-20190325/">https://www.quantamagazine.org/how-the-brain-links-gestures-perception-and-meaning-20190325/</a><br />
<br />
Gestureallowsustoexpressourselves,anditalsoshapesthewayweunderstandandinterpretothers
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2019-03-26 Tue 13:38</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
